Tekla Open API Reference for Tekla Structures 2025
FabricatorProfilesAndMaterials.ConvertSourceFile Method
 Converts a fabricator profile catalog source file to an XML file that contains a list of valid Tekla Structures catalog profiles and materials.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ConvertSourceFile(
	string profilesFilePath,
	string dimensionsFilePath
)
Public Shared Function ConvertSourceFile (
	profilesFilePath As String,
	dimensionsFilePath As String
) As Boolean
Parameters
profilesFilePath
Type: System.String
The path to the fabricator profiles and materials file.
dimensionsFilePath
Type: System.String
The path to the fabricator dimensions file.
Return Value
Type: Boolean
True if conversion was successful.
See Also
Reference
FabricatorProfilesAndMaterials Class
Tekla.Structures.Catalogs Namespace